app/views/countries/index.html.erb

SELECT "countries".* FROM "countries"
---
    <td><%= country.description %></td>
    <td><%= country.country_id %></td>