app/controllers/searches_controller.rb

  def index
    # If the autocomplete is used, it will send a parameter 'term', so we catch that here
    if params[:term]
      # Then we limit the number of records assigned to @people, by using the term value as a filter.
      @searches = Search.find(:all,:conditions => ['name LIKE ?', "%#{params[:term]}%"])
      # In my example, I still need to access all records when I first render the page,
      #so for normal use I assign all. This has nothing to do with the autocomplete,
      #just showing you how I used it in my situation.
    else
      @searches = Search.all
---
SELECT "searches".* FROM "searches" WHERE (name LIKE '%c%')
SELECT "searches".* FROM "searches"

  def show
    @search = Search.find(params[:id])
---
SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @search = Search.new(params[:search])

    respond_to do |format|
      if @search.save
---
INSERT INTO "searches" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 05 Apr 2013 16:25:36 UTC +00:00], ["name", "zermatt"], ["updated_at", Fri, 05 Apr 2013 16:25:36 UTC +00:00]]