app/controllers/searches_controller.rb

  def index
    # If the autocomplete is used, it will send a parameter 'term', so we catch that here
    #if params[:term]
    if params[:term]

      @countries = Country.find(:all,:conditions => ['name LIKE ?', "%#{params[:term].downcase}%"])
      @resorts = Resort.find(:all,:conditions => ['name LIKE ?', "%#{params[:term].downcase}%"])

      @results = []

     @resorts.each do |resort|
---
SELECT "countries".* FROM "countries" WHERE (lower(name) LIKE '%z%')
SELECT "resorts".* FROM "resorts" WHERE (lower(name) LIKE '%z%')
SELECT "resorts".* FROM "resorts"